/// <summary>
/// Шаблон для обміну значень: Реалізуйте шаблон функції, яка обмінює значення двох змінних місцями. Перевірте її роботу для цілих і дійсних типів.
/// </summary>

template <typename T>
void swapValues(T& a, T& b) {
    T temp = a;
    a = b;
    b = temp;
}

int main() {
    // Перевірка для цілих значень
    int a = 5, b = 10;
    swapValues(a, b);
    // Тепер a = 10, b = 5

    // Перевірка для дійсних значень
    double x = 3.14, y = 2.71;
    swapValues(x, y);
    // Тепер x = 2.71, y = 3.14

    return 0;
}
