# Завдання 2
# Користувач вводить із клавіатури певний текст, після чого користувач вводить список зарезервованих слів.
# Необхідно знайти в тексті всі зарезервовані слова і змінити їхній регістр на верхній. Вивести на екран змінений текст.

# Запитуємо текст та список зарезервованих слів

text = input("Введіть текст: ")
reserved_words = input("Введіть список зарезервованих слів через кому: ").lower().split(',')

# Перебираємо всі слова у тексті
for word in text.split():
   # Якщо слово є зарезервованим, то змінюємо регістр на верхній
   if word.lower() in reserved_words:
       text = text.replace(word, word.upper())

# Виводимо змінений текст
print(text)