# Завдання 7
# Напишіть функцію, яка перевіряє, чи є число паліндромом. 
# Число передається як параметр. Якщо число є паліндромом, потрібно повернути з функції true, якщо ні — false.
# Паліндром — це число, у якого перша частина цифр рівноцінна другій дзеркально відображеній частині цифр. 
# Наприклад, 123321 — паліндром (перша частина – 123, друга частина – 321, повернувши яку отримаємо 123). 546645 — паліндром, а 421987 — не паліндром.

def is_palindrome(number):
    str_num = str(number)
    return str_num == str_num[::-1]

# Виклик функції та відображення результатів
print(is_palindrome(123321))
print(is_palindrome(421987))
