# Завдання 2
# Перше число — зарплата за місяць, друге число — сума місячного платежу за кредитом у банку, третє число ­— заборгованість за комунальні послуги. 
# Необхідно вивести на екран суму, яка залишиться у користувача після всіх виплат.

# введення та валідація зарплати за місяць, суми місячного платежу та заборгованість за комунальні послуги
while(True):
    num1String = input("Введіть зарплату за місяць (грн.): ")
    if(str.isnumeric(num1String)): 
        num1 = int(num1String)
        break
    else:
        print(f"Введено невірне значення. Повторіть введення")
        continue

while(True): 
    num2String = input("Введіть суму місячного платежу за кредитом у банку (грн.): ")
    if(str.isnumeric(num2String)): 
        num2 = int(num2String)
        break
    else:
        print(f"Введено невірне значення. Повторіть введення")
        continue

# обчислення та виведення результату
while(True): 
    num3String = input("Введіть заборгованість за комунальні послуги (грн.): ")
    if(str.isnumeric(num3String)):
        num3 = int(num3String)
        break
    else:
        print(f"Введено невірне значення. Повторіть введення")
        continue

result = num1-num2-num3

if result < 0:
    print(f"Вам не вистачає грошей, щоб оплатити всі витрати {result} (грн.). Знайдіть іншу роботу!")
else:
    print(f"Сума, яка залишиться у користувача після всіх виплат дорівнює : {result} грн.")