# Кортежі з вкладеними кортежами:
# Створіть кортеж, що містить вкладені кортежі. Вручну отримайте елементи з цих вкладених кортежів.
# Створимо кортеж з вкладеними кортежами
nested_tuple = ((1, 2, 3), (4, 5, 6), (7, 8, 9))

# Отримаємо елементи з вкладених кортежів
first_tuple = nested_tuple[0]
second_tuple = nested_tuple[1]
third_tuple = nested_tuple[2]

# Виводимо результати
print("Створений кортеж з вкладеними кортежами:", nested_tuple)
print("Елементи першого кортежу:", first_tuple)
print("Елементи другого кортежу:", second_tuple)
print("Елементи третього кортежу:", third_tuple)