# Два списки цілих заповнюються випадковими числами. Необхідно:
# сформувати список, що містить елементи обох списків;
# сформувати список, що містить елементи обох списків без пов­торів;
# сформувати список, що містить елементи спільні для двох списків;
# сформувати список, що містить тільки унікальні елементи кожного зі списків;
# сформувати список, що містить тільки мінімальне та максимальне значення кожного зі списків.

import random

list1 = []
list2 = []

# Генеруємо випадкові цілі числа
for i in range(20):
    list1.append(random.randint(0, 20))
    list2.append(random.randint(0, 20))

print("Список 1: ", list1)
print("Список 2: ", list2)

# Формуємо та друкуємо списки
list3 = list1 + list2
print("Елементи обох списків: ", list3)

list4 = list(set(list1 + list2))
print("Елементи обох списків без повторів: ", list4)

list5 = list(set(list1) & set(list2))
print("Елементи, спільні для двох списків: ", list5)

list6 = list(set(list1) ^ set(list2))
print("Тільки унікальні елементи кожного зі списків: ", list6)

list7 = min(list1), max(list1), min(list2), max(list2)
print("Мінімальне та максимальне значення кожного зі списків: ", list7)